// массив с клетками поля по порядку
const CELLS = [];

// массив с вопросами
const QUESTIONS = [
  {
    theme: 1,
    text: "Как называется композиция из трёх картин или рисунков с общим замыслом, темой.",
    answers: [" диптих", "трилогия", "Триптих"],
    right: 2,
  },
  {
    theme: 1,
    text: "Кто написал картину «Утро в сосновом лесу»?",
    answers: [" Шишкин", "Репин", "Айвазовский"],
    right: 0,
  },
  {
    theme: 1,
    text: "Как называется жанр изобразительного искусства, в котором изображаются предметы неодушевлённой природы, соединённые художником в отдельную группу и представляющие собой целостную композицию»?",
    answers: [" Портрет", "Натюрморт", "Пейзаж"],
    right: 1,
  },
  {
    theme: 2,
    text: "Как называется вид сценического искусства, в котором основным средством создания художественного образа является пластика человеческого тела, без использования слов?",
    answers: [" пародия", "комедия", "пантомима"],
    right: 2,
  },
  {
    theme: 2,
    text: "Человек, который подсказывает актёру слова из его речи?",
    answers: [" суфлёр", "дирижер", "режиссер"],
    right: 0,
  },
  {
    theme: 2,
    text: "Как называется первый показ спектакля в театре?",
    answers: [" предпоказ", "сенсация", "премьера"],
    right: 2,
  },
  {
    theme: 3,
    text: "Назовите танец в умеренно-быстром темпе, в трёхдольном размере. Его основа — плавное кружение при сохранении поступательности движения?",
    answers: [" полька", "вальс", "румба"],
    right: 1,
  },
  {
    theme: 3,
    text: "Cтиль, при исполнении которого танцор использует пластичные движения, имитируя движение по телу одной или нескольких волн.?",
    answers: [" Waving", "локинг", "вог"],
    right: 0,
  },
  {
    theme: 3,
    text: "Когда были созданы самые старшие танцевальные стили?",
    answers: [" 2000-х годах", "1990-х годах", "1970-х годах"],
    right: 2,
  },
  {
    theme: 4,
    text: "В каком году издан «Указ о вольных хлебопашцах»?",
    answers: [" 19 февраля 1861", "24 июня 1801", " 4 марта 1803"],
    right: 2,
  },
  {
    theme: 4,
    text: "Какая страна была первой, кто признал независимость США?",
    answers: [" Франция", "Великобритания", "Испания"],
    right: 0,
  },
  {
    theme: 4,
    text: "Какое событие привело к подписанию Брестского мира между Россией и Центральными державами в 1918 году?",
    answers: [
      " Октябрьская революция",
      "Февральская революция",
      "Военный переворот в России",
    ],
    right: 0,
  },
  {
    theme: 5,
    text: "Какие дети наследодателя имеют право на обязательную долю в наследстве?",
    answers: [
      " нетрудоспособные",
      "несовершеннолетние или нетрудоспособные",
      "малолетние",
    ],
    right: 1,
  },
  {
    theme: 5,
    text: "Что такое юридическая фикция в правоведении?",
    answers: [
      " Предполагаемое положение, которое не соответствует действительности, но используется для удобства применения закона",
      "Искажение фактов в судебном процессе",
      "Незаконное использование юридических терминов",
    ],
    right: 0,
  },
  {
    theme: 5,
    text: "Что такое прецедентное право?",
    answers: [
      " Система права, основанная на решениях судов и предыдущих делах",
      "Правила, установленные законодателем",
      "Права и обязанности граждан, закрепленные в Конституции",
    ],
    right: 0,
  },
  {
    theme: 6,
    text: "Что означает термин гражданское общество в контексте политической науки?",
    answers: [
      " Система правительства, основанная на участии граждан",
      "Совокупность независимые организации и группы",
      "Форма правления, при которой власть принадлежит народу",
    ],
    right: 1,
  },
  {
    theme: 6,
    text: "Какая теория политической науки утверждает, что политическая власть проистекает из экономических отношений?",
    answers: [" Теория реализма", "Теория либерализма", "Теория марксизма"],
    right: 2,
  },
  {
    theme: 6,
    text: "Что представляет собой концепция реализма в теории международных отношений?",
    answers: [
      " Политика, основанная на идеалах и принципах",
      "Подход, считающий государства основными акторами мировой политики",
      "Учение о необходимости демократии в международных отношениях",
    ],
    right: 1,
  },
  {
    theme: 7,
    text: "Как называется наружная оболочка земли?",
    answers: [" Биосфера", "Гидросфера", "Литосфера", "Атмосфера"],
    right: 0,
  },
  {
    theme: 7,
    text: "Завывание сирен, прерывистые гудки предприятий означают сигнал?",
    answers: [
      "  «Внимание всем!»",
      "«Воздушная тревога!»",
      "«Отбой воздушной тревоги»",
      "«Радиационная опасность!»",
      "д)«Химическая тревога!»",
    ],
    right: 0,
  },
  {
    theme: 7,
    text: "К первичным средствам тушения пожара относят?",
    answers: [
      " внутренние пожарные краны, огнетушители",
      "воду, песок, инертные газы, пену;",
      "поваренную соль, хлорид натрия",
      "огнетушители, песок;",
    ],
    right: 3,
  },
  {
    theme: 8,
    text: "Что является древнейшей формой организации физической культуры?",
    answers: [" бега", "единоборство", "соревнования на колесницах", "игры"],
    right: 2,
  },
  {
    theme: 8,
    text: "Что является одним из основных физических качеств?",
    answers: [" внимание", "работоспособность", "сила", "здоровье"],
    right: 2,
  },
  {
    theme: 8,
    text: "Что в легкой атлетике делают с ядром?",
    answers: [" метают", "бросают", "толкают", "запускают"],
    right: 2,
  },
  {
    theme: 9,
    text: "Сколько лет назад появился наш вид Homo Sapiens?",
    answers: [
      " 2024 года назад",
      "10000 лет назад",
      "30000 лет назад",
      "200000 лет назад",
    ],
    right: 3,
  },
  {
    theme: 9,
    text: "Кто из списка является жуком?",
    answers: [" Богомол", "Паук", "Жужелица", "Сороконожка"],
    right: 2,
  },
  {
    theme: 9,
    text: "Какое самое высокое дерево в мире?",
    answers: [" Дуб", "Секвойя", "Сосна", "Баобаб"],
    right: 1,
  },
  {
    theme: 10,
    text: "Что такое экономическое благо?",
    answers: [
      " это товар, обладающий относительной редкостью",
      "это все, что служит на пользу обществу",
      "это всякий продукт, который может удовлетворять какую-либо потребность",
      "это всякий товар, произведенный в экономике",
    ],
    right: 0,
  },
  {
    theme: 10,
    text: "Что из перечисленного изучает микроэкономика?",
    answers: [
      " ВНП",
      "численность занятых в экономике",
      "общий уровень цен",
      "производство зерна и динамику его цены",
    ],
    right: 3,
  },
  {
    theme: 10,
    text: "Что является преимуществом рыночной экономики?",
    answers: [
      " автоматическое приспособление производителей к спросу, а потребителей к предложению",
      "отсутствие экологических проблем",
      "равное распределение ресурсов между отраслями",
      "нацеленность фирм, больше на рост, чем на прибыль",
    ],
    right: 0,
  },
  {
    theme: 11,
    text: "Что является объектом социологии:",
    answers: [
      " Человек",
      "Социальная жизнь человека, группы, общества",
      "Общество",
    ],
    right: 2,
  },
  {
    theme: 11,
    text: "Совокупность элементов общества и их взаимоотношений – это:",
    answers: [
      " кастовая система",
      "социальные институты",
      "социальная структура общества",
    ],
    right: 2,
  },
  {
    theme: 11,
    text: "Как называется изменение социального статуса личности?",
    answers: [" Карьера", "Социальная мобильность", "Рейтинг"],
    right: 1,
  },
  {
    theme: 12,
    text: "Порядок может быть только у матрицы следующего вида:",
    answers: [" прямоугольной", "квадратной", "матрицы-строки"],
    right: 1,
  },
  {
    theme: 12,
    text: "К записи комплексного числа в тригометрической форме не имеет отношения",
    answers: [
      " аргумент комплексного числа",
      "сумма координат точек, в виде которой отображается комплексное число",
      "модуль комплексного числа",
      "мнимая единица",
    ],
    right: 1,
  },
  {
    theme: 12,
    text: "Отношение двух однородных функций одинаковых степеней есть однородная функция",
    answers: [
      " Нулевой степени",
      "Первой степени",
      "Второй степени",
      "Степени на одну ниже степеней исходных функций",
    ],
    right: 0,
  },
  {
    theme: 13,
    text: "Для любых двух событий А и В справедливо:Р(А+=Р(А)+Р(",
    answers: [" нет", "да"],
    right: 0,
  },
  {
    theme: 13,
    text: "Дрессировщик выводит на арену 10 собачек одной колонной друг за другом. Тогда число способов это сделать, равно",
    answers: [" 11!", "10!", "9!"],
    right: 1,
  },
  {
    theme: 13,
    text: "Как называется событие, которое в результате опыта происходит или не происходит наверняка?",
    answers: [
      " детерминированным",
      "определенным",
      "неопределенным",
      "случайным",
    ],
    right: 0,
  },
  {
    theme: 14,
    text: "Матрица В называется обратной для матрицы А (квадратная порядка n), если выполняется условие",
    answers: [" АВ = ВА = Е", "AB = BA - E", "AB = BA + E"],
    right: 0,
  },
  {
    theme: 14,
    text: "Если две строки матрицы равны, то ее определитель",
    answers: [" det > 0", "det < 0", "det = 0"],
    right: 2,
  },
  {
    theme: 14,
    text: "Матрица тождественного оператора независимо от выбора базиса в линейном пространстве является единичной",
    answers: [
      " квадратной матрицей",
      "прямоугольной матрицей",
      "ортогональной матрицей",
    ],
    right: 0,
  },
  {
    theme: 15,
    text: "Сколько бит в одном мегабайте?",
    answers: [" 8", "8388608", "8192", "1024"],
    right: 3,
  },
  {
    theme: 15,
    text: "Какая самая популярная ОС на компьютеры в мире?",
    answers: [" Windows", "MacOS", "Linux", "Android"],
    right: 0,
  },
  {
    theme: 16,
    text: "Какой из этих языков программирования некомпилируемый?",
    answers: [" C", "C++", "Python", "Java"],
    right: 2,
  },
  {
    theme: 16,
    text: "Алгоритм — это:",
    answers: [
      " указание на выполнение действий",
      "процесс выполнения вычислений, приводящих к решению задачи",
      "система правил, описывающая последовательность действий, которые необходимо выполнить для решения задачи",
    ],
    right: 0,
  },
  {
    theme: 16,
    text: "Имя переменной — это:",
    answers: [
      " любая последовательность любых символов",
      "последовательность латинских букв, цифр, специальных знаков (кроме пробел)",
      "которая всегда должна начинаться с латинской буквы",
      "последовательность русских, латинских букв, начинающихся с латинской буквы и из специальных знаков, допускающая знак подчеркивания.",
    ],
    right: 1,
  },
  {
    theme: 17,
    text: "Базы данных -это?",
    answers: [
      " сложная программа, направленная учет входящей информации",
      "наборы данных, находящиеся под контролем систем управления",
      "бесконечный объем данных, постоянно управляющийся с помощью СУБД",
    ],
    right: 1,
  },
  {
    theme: 17,
    text: "Расширением файла БД является:",
    answers: [" .f2", ".mdb, .db", ".mcs"],
    right: 1,
  },
  {
    theme: 17,
    text: "Какой символ заменяет все при запросе в БД?",
    answers: [" символ (*)", "символ (/)", " символ(&)"],
    right: 0,
  },
];

// объект клетки
// - тип клетки
// - код темы
// - игроки на ней

CELLS.push({ id: 0, type: "start", theme: null, players: [] });
CELLS.push({ id: 1, type: "default", theme: 0, players: [] });
CELLS.push({ id: 2, type: "chance", theme: null, players: [] });
CELLS.push({ id: 3, type: "default", theme: 1, players: [] });
CELLS.push({ id: 4, type: "default", theme: 2, players: [] });
CELLS.push({ id: 5, type: "exam", theme: null, players: [] });
CELLS.push({ id: 6, type: "default", theme: 3, players: [] });
CELLS.push({ id: 7, type: "money", theme: null, players: [] });
CELLS.push({ id: 8, type: "default", theme: 4, players: [] });
CELLS.push({ id: 9, type: "default", theme: 5, players: [] });
CELLS.push({ id: 10, type: "home", theme: null, players: [] });
CELLS.push({ id: 11, type: "default", theme: 6, players: [] });
CELLS.push({ id: 12, type: "chance", theme: null, players: [] });
CELLS.push({ id: 13, type: "default", theme: 7, players: [] });
CELLS.push({ id: 14, type: "default", theme: 8, players: [] });
CELLS.push({ id: 15, type: "exam", theme: null, players: [] });
CELLS.push({ id: 16, type: "default", theme: 9, players: [] });
CELLS.push({ id: 17, type: "money", theme: null, players: [] });
CELLS.push({ id: 18, type: "default", theme: 10, players: [] });
CELLS.push({ id: 19, type: "default", theme: 11, players: [] });
CELLS.push({ id: 20, type: "tostart", theme: null, players: [] });
CELLS.push({ id: 21, type: "default", theme: 12, players: [] });
CELLS.push({ id: 22, type: "chance", theme: null, players: [] });
CELLS.push({ id: 23, type: "default", theme: 13, players: [] });
CELLS.push({ id: 24, type: "money", theme: null, players: [] });
CELLS.push({ id: 25, type: "exam", theme: null, players: [] });
CELLS.push({ id: 26, type: "default", theme: 14, players: [] });
CELLS.push({ id: 27, type: "money", theme: null, players: [] });
CELLS.push({ id: 28, type: "default", theme: 15, players: [] });
CELLS.push({ id: 29, type: "default", theme: 16, players: [] });
CELLS.push({ id: 30, type: "tohome", theme: null, players: [] });
CELLS.push({ id: 31, type: "default", theme: 17, players: [] });
CELLS.push({ id: 32, type: "chance", theme: null, players: [] });
CELLS.push({ id: 33, type: "default", theme: 18, players: [] });
CELLS.push({ id: 34, type: "default", theme: 19, players: [] });
CELLS.push({ id: 35, type: "exam", theme: null, players: [] });
CELLS.push({ id: 36, type: "default", theme: 20, players: [] });
CELLS.push({ id: 37, type: "money", theme: null, players: [] });
CELLS.push({ id: 38, type: "default", theme: 21, players: [] });
CELLS.push({ id: 39, type: "default", theme: 22, players: [] });

export { CELLS, QUESTIONS };
